The above still occurs when there is no protected environment resource on a project so it doesnt seem to be that.

Went back to simple basics with:
```
provider "aws" {
  region = "eu-west-1"
}

provider "gitlab" {
  alias = "gitlab-data-architecture"
  token = data.aws_ssm_parameter.gitlab_token_data_architecture.value
}

terraform {
  backend "http" {}

  required_providers {
    gitlab = {
      source = "gitlabhq/gitlab"
    }
  }
}

data "aws_ssm_parameter" "gitlab_token_data_architecture" {
  name = "/gitlab-group-tokens/data-architecture"
}

resource "gitlab_project" "project" {
  name        = "simple-test-module"
  description = "To test the latest TF module"

  path                   = ""
  default_branch         = "main"
  merge_requests_enabled = true

  namespace_id = "123456"

  visibility_level = "private"

  provider = gitlab.gitlab-data-architecture
}
```
still getting the read only changes on second run:
```
  # gitlab_project.project will be updated in-place
  ~ resource "gitlab_project" "project" {
      ~ http_url_to_repo                                 = "https://gitlab.com/company/data-architecture/data-platform/terraform-modules/simple-test-module.git" -> (known after apply)
        id                                               = "0987654321"
        name                                             = "simple-test-module"
      ~ path_with_namespace                              = "company/data-architecture/data-platform/terraform-modules/simple-test-module" -> (known after apply)
      ~ ssh_url_to_repo                                  = "git@gitlab.com:company/data-architecture/data-platform/terraform-modules/simple-test-module.git" -> (known after apply)
        tags                                             = []
      ~ web_url                                          = "https://gitlab.com/company/data-architecture/data-platform/terraform-modules/simple-test-module" -> (known after apply)
        # (56 unchanged attributes hidden)
        # (2 unchanged blocks hidden)
    }
```
and on apply i get the current issue so it seems to be this that is triggering the `PUT` but have no idea why this update is occuring:
```
2022-08-11T13:48:11.981Z [INFO]  provider.terraform-provider-gitlab_v3.16.1: 2022/08/11 13:48:11 [DEBUG] GitLab API Request Details:
---[ REQUEST ]---------------------------------------
PUT /api/v4/projects/0987654321 HTTP/1.1
Host: gitlab.com
User-Agent: Terraform/1.2.6 (+https://www.terraform.io/) Terraform-Plugin-SDK/2.10.1 terraform-provider-gitlab/3.16.1
Content-Length: 29
Accept: application/json
Authorization: Bearer <correct-token>
Content-Type: application/json
Accept-Encoding: gzip
{
 "name": "simple-test-module"
}
```